Repository: weblate/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/API_Server.po
Languages: pt_br

source: This document describes Klipper's Application Programmer Interface (API). This interface enables external applications to query and control the Klipper host software.
pt_br: Este documento descreve a Interface do Programador de Aplicativos (API) da Klipper. Esta interface permite que aplicativos externos consultem e controlem o software de host Klipper.

source: Enabling the API socket
pt_br: Habilitando o soquete de API

source: In order to use the API server, the klippy.py host software must be started with the `-a` parameter. For example:
pt_br: Para usar o servidor API, o software host klippy.py deve ser iniciado com o parâmetro `-a`. Por exemplo:

source: This causes the host software to create a Unix Domain Socket. A client can then open a connection on that socket and send commands to Klipper.
pt_br: Isso faz com que o software host crie um Soquete de domínio Unix, um cliente pode então abrir uma conexão nesse soquete e enviar comandos para Klipper.

source: Request format
pt_br: Formato da solicitação

source: Messages sent and received on the socket are JSON encoded strings terminated by an ASCII 0x03 character:
pt_br: As mensagens enviadas e recebidas no soquete são strings codificadas em JSON terminadas por um caractere ASCII 0x03:

source: Klipper contains a `scripts/whconsole.py` tool that can perform the above message framing. For example:
pt_br: O Klipper contém uma ferramenta `scripts/whconsole.py` que pode executar o enquadramento de mensagem acima. Por exemplo:

source: This tool can read a series of JSON commands from stdin, send them to Klipper, and report the results. The tool expects each JSON command to be on a single line, and it will automatically append the 0x03 terminator when transmitting a request. (The Klipper API server does not have a newline requirement.)
pt_br: Esta ferramenta pode ler uma série de comandos JSON do stdin, enviá-los ao Klipper e relatar os resultados. A ferramenta espera que cada comando JSON esteja em uma única linha, e anexará automaticamente o terminador 0x03 ao transmitir uma solicitação. (O servidor API Klipper não possui um requisito de nova linha.)

source: API Protocol
pt_br: Protocolo de API

source: The command protocol used on the communication socket is inspired by [json-rpc](https://www.jsonrpc.org/).
pt_br: O protocolo de comando usado no soquete de comunicação é inspirado em [json-rpc](https://www.jsonrpc.org/).

source: A request might look like:
pt_br: Uma solicitação pode ser semelhante a:

source: and a response might look like:
pt_br: e uma resposta pode ser semelhante a:

source: Each request must be a JSON dictionary. (This document uses the Python term "dictionary" to describe a "JSON object" - a mapping of key/value pairs contained within `{}`.)
pt_br: Cada solicitação deve ser um dicionário JSON. (Este documento usa o termo "dicionário" do Python para descrever um "objeto JSON" - um mapeamento de chaves/valores contidos em `{}`.)

source: The request dictionary must contain a "method" parameter that is the string name of an available Klipper "endpoint".
pt_br: O dicionário da solicitação deve conter um parâmetro "method" que é o nome da string de um "endpoint" disponível do Klipper.

source: The request dictionary may contain a "params" parameter which must be of a dictionary type. The "params" provide additional parameter information to the Klipper "endpoint" handling the request. Its content is specific to the "endpoint".
pt_br: O dicionário da solicitação pode conter um parâmetro "params" que deve ser do tipo dicionário. Os "parâmetros" fornecem informações de parâmetros para o "endpoint" do Klipper que trata a solicitação. Seu conteúdo é específico para o “endpoint”.

source: The request dictionary may contain an "id" parameter which may be of any JSON type. If "id" is present then Klipper will respond to the request with a response message containing that "id". If "id" is omitted (or set to a JSON "null" value) then Klipper will not provide any response to the request. A response message is a JSON dictionary containing "id" and "result". The "result" is always a dictionary - its contents are specific to the "endpoint" handling the request.
pt_br: O dicionário da solicitação pode conter um parâmetro "parâmetros" que deve ser o tipo dicionário. Os "parâmetros" fornecem informações de parâmetros adicionais para o "endpoint" do Klipper que trata a solicitação. Seu conteúdo é específico para o “endpoint”.

source: If the processing of a request results in an error, then the response message will contain an "error" field instead of a "result" field. For example, the request: `{"id": 123, "method": "gcode/script", "params": {"script": "G1 X200"}}` might result in an error response such as: `{"id": 123, "error": {"message": "Must home axis first: 200.000 0.000 0.000 [0.000]", "error": "WebRequestError"}}`
pt_br: Se o processamento de uma solicitação resultar em um erro, a mensagem de resposta conterá um campo "error" em vez de um campo "result". Por exemplo, a solicitação: `{"id": 123, "method": "gcode/script", "params": {"script": "G1 X200"}}` pode resultar em uma resposta de erro como: ` {"id": 123, "error": {"message": "Must home axis first: 200.000 0.000 0.000 [0.000]", "error": "WebRequestError"}}`

source: Klipper will always start processing requests in the order that they are received. However, some request may not complete immediately, which could cause the associated response to be sent out of order with respect to responses from other requests. A JSON request will never pause the processing of future JSON requests.
pt_br: O Klipper sempre começará a processar as solicitações na ordem em que forem recebidas. No entanto, algumas solicitações podem não ser concluídas imediatamente, o que pode fazer com que a resposta associada seja enviada fora de ordem em relação às outras respostas. Uma solicitação JSON nunca pausará o processamento de solicitações JSON futuras.

source: Subscriptions
pt_br: Assinaturas (Subscriptions)

source: Some Klipper "endpoint" requests allow one to "subscribe" to future asynchronous update messages.
pt_br: Algumas solicitações de "endpoint" do Klipper permitem "assinar" (subscribe) futuras mensagens de atualização assíncronas (async).

source: For example:
pt_br: Por exemplo:

source: may initially respond with:
pt_br: pode responder com:

source: and cause Klipper to send future messages similar to:
pt_br: e fazer com que o Klipper envie mensagens semelhantes a:

source: A subscription request accepts a "response_template" dictionary in the "params" field of the request. That "response_template" dictionary is used as a template for future asynchronous messages - it may contain arbitrary key/value pairs. When sending these future asynchronous messages, Klipper will add a "params" field containing a dictionary with "endpoint" specific contents to the response template and then send that template. If a "response_template" field is not provided then it defaults to an empty dictionary (`{}`).
pt_br: Uma solicitação de uma assinatura aceita um dicionário "response_template" no campo "params" da solicitação. Esse dicionário "response_template" é usado como modelo para futuras mensagens assíncronas (async) - ele pode conter pares chave/valor arbitrários. Ao enviar essas futuras mensagens assíncronas, o Klipper adicionará um campo "params" contendo um dicionário com conteúdo específico do "endpoint" ao modelo de resposta e então enviará esse modelo. Se um campo "response_template" não for fornecido, o padrão será um dicionário vazio (`{}`).

source: Available "endpoints"
pt_br: "endpoints" disponíveis

source: By convention, Klipper "endpoints" are of the form `<module_name>/<some_name>`. When making a request to an "endpoint", the full name must be set in the "method" parameter of the request dictionary (eg, `{"method"="gcode/restart"}`).
pt_br: Os "endpoints" do Klipper têm o formato `<nome_do_modulo>/<algum_nome>`. Ao fazer uma solicitação para um "endpoint", o nome completo deve ser definido no parâmetro "method" do dicionário da solicitação (por exemplo, `{"method"="gcode/restart"}`).

source: info
pt_br: informações

source: The "info" endpoint is used to obtain system and version information from Klipper. It is also used to provide the client's version information to Klipper. For example: `{"id": 123, "method": "info", "params": { "client_info": { "version": "v1"}}}`
pt_br: O endpoint "info" é usado para obter informações do sistema e da versão do Klipper. Também é usado para fornecer informações de versão do Klipper. Por exemplo: `{"id": 123, "method": "info", "params": { "client_info": { "version": "v1"}}}`

source: If present, the "client_info" parameter must be a dictionary, but that dictionary may have arbitrary contents. Clients are encouraged to provide the name of the client and its software version when first connecting to the Klipper API server.
pt_br: Se existir, o parâmetro "client_info" deve ser um dicionário, mas esse dicionário pode ter conteúdo arbitrário. Os clientes são incentivados a fornecer o nome do cliente e sua versão do software ao se conectarem pela primeira vez à API do Klipper.

source: The "emergency_stop" endpoint is used to instruct Klipper to transition to a "shutdown" state. It behaves similarly to the G-Code `M112` command. For example: `{"id": 123, "method": "emergency_stop"}`
pt_br: O endpoint "emergency_stop" é usado para instruir o Klipper a desligar imediatamente. Se comporta de forma semelhante ao comando G-Code `M112`. Por exemplo: `{"id": 123, "method": "emergency_stop"}`

source: This endpoint allows clients to register methods that can be called from klipper. It will return an empty object upon success.
pt_br: Este endpoint permite que os clientes registrem métodos que podem ser chamados pelo klipper. Ele retornará um objeto vazio em caso de sucesso.

source: For example: `{"id": 123, "method": "register_remote_method", "params": {"response_template": {"action": "run_paneldue_beep"}, "remote_method": "paneldue_beep"}}` will return: `{"id": 123, "result": {}}`
pt_br: Por exemplo: `{"id": 123, "method": "register_remote_method", "params": {"response_template": {"action": "run_paneldue_beep"}, "remote_method": "paneldue_beep"}}` retornará : `{"id": 123, "resultado": {}}`

source: The remote method `paneldue_beep` may now be called from Klipper. Note that if the method takes parameters they should be provided as keyword arguments. Below is an example of how it may called from a gcode_macro:
pt_br: O `paneldue_beep` agora pode ser chamado pelo Klipper. Observe que se o método aceita parâmetros, eles devem ser fornecidos como argumentos de palavras-chave. Abaixo está um exemplo de como ele pode ser chamado a partir de um gcode_macro:

source: When the PANELDUE_BEEP gcode macro is executed, Klipper would send something like the following over the socket: `{"action": "run_paneldue_beep", "params": {"frequency": 300, "duration": 1.0}}`
pt_br: Quando a macro PANELDUE_BEEP é executada, o Klipper enviaria algo como: `{"action": "run_paneldue_beep", "params": {"frequency": 300, "duration": 1.0}}`

source: This endpoint queries the list of available printer "objects" that one may query (via the "objects/query" endpoint). For example: `{"id": 123, "method": "objects/list"}` might return: `{"id": 123, "result": {"objects": ["webhooks", "configfile", "heaters", "gcode_move", "query_endstops", "idle_timeout", "toolhead", "extruder"]}}`
pt_br: Esse endpoint consulta a lista de "objetos" disponíveis que podem ser consultados (através do endpoint"objects/query"). Por exemplo: `{"id": 123, "method": "objects/list"}` pode retornar: `{"id": 123, "result": {"objects": ["webhooks", "configfile" , "aquecedores", "gcode_move", "query_endstops", "idle_timeout", "toolhead", "extrusora"]}}`

source: This endpoint allows one to query information from printer objects. For example: `{"id": 123, "method": "objects/query", "params": {"objects": {"toolhead": ["position"], "webhooks": null}}}` might return: `{"id": 123, "result": {"status": {"webhooks": {"state": "ready", "state_message": "Printer is ready"}, "toolhead": {"position": [0.0, 0.0, 0.0, 0.0]}}, "eventtime": 3051555.377933684}}`
pt_br: Este endpoint permite consultar informações de objetos de impressora. Por exemplo: `{"id": 123, "method": "objects/query", "params": {"objects": {"toolhead": ["position"], "webhooks": null}}}` pode retornar: `{"id": 123, "result": {"status": {"webhooks": {"state": "ready", "state_message": "Printer is ready"}, "toolhead": { "posição": [0,0, 0,0, 0,0, 0,0]}}, "eventtime": 3051555.377933684}}`

source: The "objects" parameter in the request must be a dictionary containing the printer objects that are to be queried - the key contains the printer object name and the value is either "null" (to query all fields) or a list of field names.
pt_br: O parâmetro "objetos" na solicitação deve ser um dicionário contendo os objetos de impressora que serão consultados - a chave contém o nome do objeto de impressora e o valor é "nulo" (para consultar todos os campos) ou uma lista de nomes dos campos.

source: The response message will contain a "status" field containing a dictionary with the queried information - the key contains the printer object name and the value is a dictionary containing its fields. The response message will also contain an "eventtime" field containing the timestamp from when the query was taken.
pt_br: A mensagem de resposta conterá um campo "status" contendo um dicionário com as informações consultadas - a chave contém o nome do objeto impressora e o valor é um dicionário contendo seus campos. A mensagem de resposta também conterá um campo “eventtime” contendo data/hora de quando a consulta foi feita.

source: Available fields are documented in the [Status Reference](Status_Reference.md) document.
pt_br: Os campos disponíveis estão documentados no documento [Status Reference](Status_Reference.md).

source: This endpoint allows one to query and then subscribe to information from printer objects. The endpoint request and response is identical to the "objects/query" endpoint. For example: `{"id": 123, "method": "objects/subscribe", "params": {"objects":{"toolhead": ["position"], "webhooks": ["state"]}, "response_template":{}}}` might return: `{"id": 123, "result": {"status": {"webhooks": {"state": "ready"}, "toolhead": {"position": [0.0, 0.0, 0.0, 0.0]}}, "eventtime": 3052153.382083195}}` and result in subsequent asynchronous messages such as: `{"params": {"status": {"webhooks": {"state": "shutdown"}}, "eventtime": 3052165.418815847}}`
pt_br: Esse endpoint permite consultar e assinar informações de objetos de impressora. A solicitação e a resposta do endpoint são idênticas ao endpoint "objects/query". Por exemplo: `{"id": 123, "method": "objects/subscribe", "params": {"objects":{"toolhead": ["position"], "webhooks": ["state"] }, "response_template":{}}}` pode retornar: `{"id": 123, "result": {"status": {"webhooks": {"state": "ready"}, "toolhead": {"position": [0.0, 0.0, 0.0, 0.0]}}, "eventtime": 3052153.382083195}}` e resulta em mensagens assíncronas (async) subsequentes, como: `{"params": {"status": {"webhooks": {"state": "shutdown"}}, "eventtime": 3052165.418815847}}`

source: This endpoint allows one to query available G-Code commands that have a help string defined. For example: `{"id": 123, "method": "gcode/help"}` might return: `{"id": 123, "result": {"RESTORE_GCODE_STATE": "Restore a previously saved G-Code state", "PID_CALIBRATE": "Run PID calibration test", "QUERY_ADC": "Report the last value of an analog pin", ...}}`
pt_br: Este endpoint permite consultar comandos G-Code disponíveis que possuem uma string de ajuda. Por exemplo: `{"id": 123, "method": "gcode/help"}` pode retornar: `{"id": 123, "result": {"RESTORE_GCODE_STATE": "Restore a previously saved G-Code state", "PID_CALIBRATE": "Run PID calibration test", "QUERY_ADC": "Report the last value of an analog pin", ...}}`

source: This endpoint allows one to run a series of G-Code commands. For example: `{"id": 123, "method": "gcode/script", "params": {"script": "G90"}}`
pt_br: Este endpoint permite executar uma série de comandos G-Code. Por exemplo: `{"id": 123, "method": "gcode/script", "params": {"script": "G90"}}`

source: If the provided G-Code script raises an error, then an error response is generated. However, if the G-Code command produces terminal output, that terminal output is not provided in the response. (Use the "gcode/subscribe_output" endpoint to obtain G-Code terminal output.)
pt_br: Se o script G-Code fornecido gerar um erro, uma resposta de erro será gerada. No entanto, se o comando G-Code produzir um output no terminal, esse output não será fornecida na resposta. (Use o endpoint "gcode/subscribe_output" para obter o output do terminal G-Code.)

source: If there is a G-Code command being processed when this request is received, then the provided script will be queued. This delay could be significant (eg, if a G-Code wait for temperature command is running). The JSON response message is sent when the processing of the script fully completes.
pt_br: Se houver um comando G-Code sendo processado quando esta solicitação for recebida, o script fornecido será enfileirado. Este atraso pode ser significativo (por exemplo, se um comando de espera por temperatura do G-Code estiver em execução). A mensagem de resposta JSON é enviada quando o processamento do script é totalmente concluído.

source: This endpoint allows one to request a restart - it is similar to running the G-Code "RESTART" command. For example: `{"id": 123, "method": "gcode/restart"}`
pt_br: Este endpoint permite solicitar uma reinicialização - é semelhante a executar o comando "RESTART" do G-Code. Por exemplo: `{"id": 123, "method": "gcode/restart"}`

source: As with the "gcode/script" endpoint, this endpoint only completes after any pending G-Code commands complete.
pt_br: Tal como acontece com o endpoint "gcode/script", este endpoint só é concluído após a conclusão de qualquer comando G-Code pendente.

source: This is similar to the "gcode/restart" endpoint - it implements the G-Code "FIRMWARE_RESTART" command. For example: `{"id": 123, "method": "gcode/firmware_restart"}`
pt_br: Isso é semelhante ao endpoint "gcode/restart" - ele executa "FIRMWARE_RESTART". Por exemplo: `{"id": 123, "método": "gcode/firmware_restart"}`

source: This endpoint is used to subscribe to G-Code terminal messages that are generated by Klipper. For example: `{"id": 123, "method": "gcode/subscribe_output", "params": {"response_template":{}}}` might later produce asynchronous messages such as: `{"params": {"response": "// Klipper state: Shutdown"}}`
pt_br: Este endpoint é usado para assinar (subscribe) em mensagens de terminal G-Code geradas pelo Klipper. Por exemplo: `{"id": 123, "method": "gcode/subscribe_output", "params": {"response_template":{}}}` pode posteriormente produzir mensagens assíncronas (async) como: `{"params": { "response": "// Klipper state: Shutdown"}}`

source: This endpoint is intended to support human interaction via a "terminal window" interface. Parsing content from the G-Code terminal output is discouraged. Use the "objects/subscribe" endpoint to obtain updates on Klipper's state.
pt_br: Este endpoint destina-se a oferecer suporte à interação humana por meio de uma interface do terminal. A análise do conteúdo da saída do terminal G-Code não é recomendada. Use o endpoint "objects/subscribe" para obter atualizações sobre o estado do Klipper.

source: This endpoint is similar to running the "PRINT_CANCEL" G-Code command. For example: `{"id": 123, "method": "pause_resume/cancel"}`
pt_br: Este endpoint é semelhante à executar "PRINT_CANCEL". Por exemplo: `{"id": 123, "method": "pause_resume/cancel"}`

source: This endpoint is similar to running the "PAUSE" G-Code command. For example: `{"id": 123, "method": "pause_resume/pause"}`
pt_br: Este endpoint é semelhante à executar "PAUSE". Por exemplo: `{"id": 123, "method": "pause_resume/pause"}`

source: This endpoint is similar to running the "RESUME" G-Code command. For example: `{"id": 123, "method": "pause_resume/resume"}`
pt_br: Este endpoint é semelhante à executar"RESUME". Por exemplo: `{"id": 123, "method": "pause_resume/resume"}`

source: This endpoint will query the active endpoints and return their status. For example: `{"id": 123, "method": "query_endstops/status"}` might return: `{"id": 123, "result": {"y": "open", "x": "open", "z": "TRIGGERED"}}`
pt_br: Este endpoint consultará os endpoints ativos e retornará o status. Por exemplo: `{"id": 123, "method": "query_endstops/status"}` pode retornar: `{"id": 123, "result": {"y": "open", "x": "open", "z": "TRIGGERED"}}`

source: API server
pt_br: API do Server

source: This endpoint is used to subscribe to Klipper's internal stepper queue_step command stream for a stepper. Obtaining these low-level motion updates may be useful for diagnostic and debugging purposes. Using this endpoint may increase Klipper's system load.
pt_br: Este endpoint é usado para assinar o fluxo do stepper queue_step interno do Klipper. Obter essas atualizações de movimento de baixo nível pode ser útil para fins de diagnóstico e debug. Usar este endpoint pode aumentar a carga do hardware do sistema do Klipper.

source: A request may look like: `{"id": 123, "method":"motion_report/dump_stepper", "params": {"name": "stepper_x", "response_template": {}}}` and might return: `{"id": 123, "result": {"header": ["interval", "count", "add"]}}` and might later produce asynchronous messages such as: `{"params": {"first_clock": 179601081, "first_time": 8.98, "first_position": 0, "last_clock": 219686097, "last_time": 10.984, "data": [[179601081, 1, 0], [29573, 2, -8685], [16230, 4, -1525], [10559, 6, -160], [10000, 976, 0], [10000, 1000, 0], [10000, 1000, 0], [10000, 1000, 0], [9855, 5, 187], [11632, 4, 1534], [20756, 2, 9442]]}}`
pt_br: Uma solicitação pode ser semelhante a: `{"id": 123, "method":"motion_report/dump_stepper", "params": {"name": "stepper_x", "response_template": {}}}` and might return: `{"id": 123, "result": {"header": ["interval", "count", "add"]}}` and might later produce asynchronous messages such as: `{"params": {"first_clock": 179601081, "first_time": 8.98, "first_position": 0, "last_clock": 219686097, "last_time": 10.984, "data": [[179601081, 1, 0], [29573, 2, -8685], [16230, 4, -1525], [10559, 6, -160], [10000, 976, 0], [10000, 1000, 0], [10000, 1000, 0], [10000, 1000, 0], [9855, 5, 187], [11632, 4, 1534], [20756, 2, 9442]]}}`

source: The "header" field in the initial query response is used to describe the fields found in later "data" responses.
pt_br: O campo "header" na resposta da consulta inicial é usado para descrever os campos encontrados nas respostas de "data" (dados) posteriores.

source: This endpoint is used to subscribe to Klipper's internal "trapezoid motion queue". Obtaining these low-level motion updates may be useful for diagnostic and debugging purposes. Using this endpoint may increase Klipper's system load.
pt_br: Este endpoint é usado para assinar a "fila de movimento trapezoidal" (trapezoid motion queue) interna do Klipper. Obter essas atualizações de movimento de baixo nível pode ser útil para fins de diagnóstico e debug. Usar este endpoint pode aumentar a carga do hardware do sistema do Klipper.
