Repository: weblate/klipper-translations
Catalog: docs/locales/*/LC_MESSAGES/OctoPrint.po
Languages: es, hu

source: OctoPrint for Klipper
es: OctoPrint para Klipper
hu: OctoPrint a Klipper-hez

source: Klipper has a few options for its front ends, Octoprint was the first and original front end for Klipper. This document will give a brief overview of installing with this option.
es: Klipper tiene algunas opciones para sus interfaces, Octoprint fue la primera y original interfaz para Klipper. Este documento dará una breve visión general de la instalación con esta opción.
hu: A Klipper-nek van néhány opciója az alaplapokhoz, az Octoprint volt a Klipper első és eredeti kezelőfelülete. Ez a dokumentum rövid áttekintést ad az ezzel az opcióval történő telepítésről.

source: Install with OctoPi
es: Instalar con OctoPi
hu: Telepítés OctoPi-vel

source: Start by installing [OctoPi](https://github.com/guysoft/OctoPi) on the Raspberry Pi computer. Use OctoPi v0.17.0 or later - see the [OctoPi releases](https://github.com/guysoft/OctoPi/releases) for release information.
es: Comienza instalando [OctoPi](https://github.com/guysoft/OctoPi) en el ordenador Raspberry Pi. Utiliza OctoPi v0.17.0 o posterior - consulta las [versiones de OctoPi](https://github.com/guysoft/OctoPi/releases) para obtener información sobre la versión.
hu: Kezdd az [OctoPi](https://github.com/guysoft/OctoPi) telepítésével a Raspberry Pi számítógépre. Használd az OctoPi v0.17.0 vagy újabb verziót - a kiadással kapcsolatos információkért tekintsd meg az [OctoPi kiadást](https://github.com/guysoft/OctoPi/releases).

source: One should verify that OctoPi boots and that the OctoPrint web server works. After connecting to the OctoPrint web page, follow the prompt to upgrade OctoPrint if needed.
es: Debes comprobar que OctoPi se inicia y que el servidor web OctoPrint funciona. Tras conectarse a la página web de OctoPrint, sigue las instrucciones para actualizar OctoPrint si es necesario.
hu: Ellenőrizni kell, hogy az OctoPi elindul-e, és hogy az OctoPrint webszerver működik-e. Miután csatlakoztál az OctoPrint weblaphoz, kövesd a felszólítást az OctoPrint frissítésére, ha szükséges.

source: After installing OctoPi and upgrading OctoPrint, it will be necessary to ssh into the target machine to run a handful of system commands.
es: Después de instalar OctoPi y actualizar OctoPrint, será necesario hacer ssh en la máquina de destino para ejecutar un puñado de comandos del sistema.
hu: Az OctoPi telepítése és az OctoPrint frissítése után be kell lépned a célgépre, hogy futtass egy maréknyi rendszerparancsot.

source: Start by running these commands on your host device:
hu: Kezd a következő parancsok futtatásával a gazdagépen:

source: **If you do not have git installed, please do so with:**
es: **Si no tienes git instalado, por favor hazlo con:**
hu: **Ha nincs telepítve a git, kérjük, tedd ezt meg:**

source: then proceed:
es: y luego prosigue:
hu: majd folytasd:

source: The above will download Klipper, install the needed system dependencies, setup Klipper to run at system startup, and start the Klipper host software. It will require an internet connection and it may take a few minutes to complete.
es: Lo anterior descargará Klipper, instalará las dependencias del sistema necesarias, configurará Klipper para que se ejecute al iniciar el sistema e iniciará el software anfitrión de Klipper. Requiere una conexión a Internet y puede tardar unos minutos en completarse.
hu: A fentiek letöltik a Klippert, telepítik a szükséges rendszerfüggőségeket, beállítják a Klippert, hogy a rendszer indításakor fusson, és elindítják a Klipper gazda szoftvert. Ehhez internetkapcsolat szükséges, és a művelet befejezése néhány percet vehet igénybe.

source: Installing with KIAUH
es: Instalando con KIAUH
hu: Telepítés KIAUH-val

source: KIAUH can be used to install OctoPrint on a variety of Linux based systems that run a form of Debian. More information can be found at https://github.com/dw-0/kiauh
es: KIAUH puede usarse para instalar OctoPrint en una variedad de sistemas basados en Linux que ejecuten una forma de Debian. Encontrarás más información en https://github.com/dw-0/kiauh
hu: A KIAUH használható az OctoPrint telepítéséhez számos Linux alapú rendszerre, amelyeken a Debian egy formája fut. További információ található itt https://github.com/dw-0/kiauh

source: Configuring OctoPrint to use Klipper
es: Configurando OctoPrint para utilizar Klipper
hu: OctoPrint beállítása a Klipper használatához

source: The OctoPrint web server needs to be configured to communicate with the Klipper host software. Using a web browser, login to the OctoPrint web page and then configure the following items:
es: Es necesario configurar el servidor web OctoPrint para que se comunique con el software anfitrión Klipper. Mediante un navegador web, inicia sesión en la página web de OctoPrint y, a continuación, configura los siguientes elementos:
hu: Az OctoPrint webszerverét úgy kell konfigurálni, hogy kommunikálni tudjon a Klipper gazda szoftverrel. Egy webböngésző segítségével jelentkezz be az OctoPrint weboldalára, majd konfiguráld a következő elemeket:

source: Navigate to the Settings tab (the wrench icon at the top of the page). Under "Serial Connection" in "Additional serial ports" add:
es: Vete a la pestaña Configuración (el icono de llave inglesa en la parte superior de la página). En "Conexión serie" en "Puertos serie adicionales" añadir:
hu: Navigálj a Beállítások fülre (a csavarkulcs ikon az oldal tetején). A "Soros kapcsolat" alatt a "További soros portok" alatt add hozzá:

source: Then click "Save".
es: A continuación, haz clic en "Guardar".
hu: Ezután kattints a "Mentés" gombra.

source: *In some older setups this address may be `/tmp/printer`*
es: *En algunas configuraciones antiguas esta dirección puede ser `/tmp/printer`*
hu: *Némely régebbi rendszerben ez a cím lehet `/tmp/printer`*

source: Enter the Settings tab again and under "Serial Connection" change the "Serial Port" setting to the one added above.
es: Vuelve a entrar en la pestaña Configuración y en "Conexión serie" cambia la configuración de "Puerto serie" por la añadida anteriormente.
hu: Lépj be ismét a Beállítások fülre, és a "Soros kapcsolat" alatt módosítsd a "Soros port" beállítást a fent megadottra.

source: In the Settings tab, navigate to the "Behavior" sub-tab and select the "Cancel any ongoing prints but stay connected to the printer" option. Click "Save".
es: En la pestaña "Configuración", vete a la subpestaña "Comportamiento" y selecciona la opción "Cancelar cualquier impresión en curso pero permanecer conectado a la impresora". Haz clic en "Guardar".
hu: A Beállítások lapon navigálj a "Viselkedés" alfülre, és válaszd a "Folyamatban lévő nyomtatások törlése, de a nyomtatóhoz való csatlakozás fenntartása" lehetőséget. Kattints a "Mentés" gombra.

source: From the main page, under the "Connection" section (at the top left of the page) make sure the "Serial Port" is set to the new additional one added and click "Connect". (If it is not in the available selection then try reloading the page.)
es: Desde la página principal, en la sección "Conexión" (en la parte superior izquierda de la página) asegúrate de que el "Puerto serie" está ajustado al nuevo añadido y haz clic en "Conectar". (Si no estás en la selección disponible, intenta recargar la página).
hu: A főoldalon a "Csatlakozás" szakaszban (az oldal bal felső részén) győződj meg róla, hogy a "Soros port" az újonnan hozzáadott kiegészítő portra van beállítva, majd kattints a "Csatlakozás" gombra. (Ha nincs a rendelkezésre álló választékban, akkor próbáld meg újratölteni az oldalt.)

source: Once connected, navigate to the "Terminal" tab and type "status" (without the quotes) into the command entry box and click "Send". The terminal window will likely report there is an error opening the config file - that means OctoPrint is successfully communicating with Klipper.
es: Una vez conectado, vete a la pestaña "Terminal" y escribe "status" (sin las comillas) en el cuadro de entrada de comandos y haz clic en "Enviar". La ventana del terminal probablemente informará de que hay un error al abrir el archivo de configuración, lo que significa que OctoPrint se está comunicando correctamente con Klipper.
hu: Ha csatlakoztál, navigálj a "Terminál" fülre, és írd be a "status" (idézőjelek nélkül) parancsot a parancsbeviteli mezőbe, majd kattints a "Küldés" gombra. A terminálablak valószínűleg azt fogja jelenteni, hogy hiba történt a konfigurációs fájl megnyitásakor - ez azt jelenti, hogy az OctoPrint sikeresen kommunikál a Klipper-rel.

source: Please proceed to <Installation.md> and the *Building and flashing the micro-controller* section
es: Consulta <Installation.md> y la sección *Construcción y flasheo del microcontrolador*
hu: Kérjük, folytasd az <Installation.md> és *A mikrokontroller építése és égetése* részt
